In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('titanic.csv')

In [3]:
ipl = pd.read_csv('matches.csv')

In [4]:
titanic.shape

(1309, 12)

In [5]:
titanic.head(6)

,Unnamed: 0,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
0,0,NaN,S,7.2500,3,A/5 21171,22.0,"Braund, Mr. Owen Harris",0,male,1,0.0
1,1,C85,C,71.2833,1,PC 17599,38.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,female,1,1.0
2,2,NaN,S,7.9250,3,STON/O2. 3101282,26.0,"Heikkinen, Miss. Laina",0,female,0,1.0
3,3,C123,S,53.1000,1,113803,35.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,female,1,1.0
4,4,NaN,S,8.0500,3,373450,35.0,"Allen, Mr. William Henry",0,male,0,0.0
5,5,NaN,Q,8.4583,3,330877,NaN,"Moran, Mr. James",0,male,0,0.0

In [7]:
col = list(titanic.columns)

In [8]:
col

['Unnamed: 0',
 'Cabin',
 'Embarked',
 'Fare',
 'Pclass',
 'Ticket',
 'Age',
 'Name',
 'Parch',
 'Sex',
 'SibSp',
 'Survived']

In [9]:
del titanic['Unnamed: 0']

In [10]:
titanic.isna().sum()

Cabin       1014
Embarked       2
Fare           1
Pclass         0
Ticket         0
Age          263
Name           0
Parch          0
Sex            0
SibSp          0
Survived     418
dtype: int64

In [11]:
titanic['Pclass'].unique()

array([3, 1, 2])

In [12]:
titanic[titanic.Pclass == 1]['Fare']

1        71.2833
3        53.1000
6        51.8625
11       26.5500
23       35.5000
          ...
1294     47.1000
1295     27.7208
1298    211.5000
1302     90.0000
1305    108.9000
Name: Fare, Length: 323, dtype: float64

In [13]:
titanic[titanic.Pclass == 2]['Fare']

9       30.0708
15      16.0000
17      13.0000
20      26.0000
21      13.0000
         ...
1278    13.0000
1284    10.5000
1292    21.0000
1296    13.8625
1297    10.5000
Name: Fare, Length: 277, dtype: float64

In [14]:
titanic[titanic.Pclass == 3]['Fare']

0        7.2500
2        7.9250
4        8.0500
5        8.4583
7       21.0750
         ...
1303     7.7750
1304     8.0500
1306     7.2500
1307     8.0500
1308    22.3583
Name: Fare, Length: 709, dtype: float64

In [15]:
titanic[titanic.Pclass == 1]['Fare'].mean()

87.5089916408668

In [16]:
titanic[titanic.Pclass == 2]['Fare'].mean()

21.1791963898917

In [17]:
titanic[titanic.Pclass == 3]['Fare'].mean()

13.302888700564969

In [18]:
titanic.count()

Cabin        295
Embarked    1307
Fare        1308
Pclass      1309
Ticket      1309
Age         1046
Name        1309
Parch       1309
Sex         1309
SibSp       1309
Survived     891
dtype: int64

In [19]:
eg_titanic = titanic.groupby('Embarked')

In [20]:
len(eg_titanic)

3

In [21]:
eg_titanic.groups

{'C': Int64Index([   1,    9,   19,   26,   30,   31,   34,   36,   39,   42,
             ...
             1260, 1262, 1266, 1288, 1293, 1295, 1296, 1298, 1305, 1308],
            dtype='int64', length=270),
 'Q': Int64Index([   5,   16,   22,   28,   32,   44,   46,   47,   82,  109,
             ...
             1206, 1249, 1271, 1272, 1279, 1287, 1290, 1299, 1301, 1302],
            dtype='int64', length=123),
 'S': Int64Index([   0,    2,    3,    4,    6,    7,    8,   10,   11,   12,
             ...
             1289, 1291, 1292, 1294, 1297, 1300, 1303, 1304, 1306, 1307],
            dtype='int64', length=914)}

In [24]:
for name, group in eg_titanic:
    print(name, round(group.Age.mean(), 2))

C 32.33
Q 28.63
S 29.25

In [25]:
titanic.Age.mean()

29.881137667304014

In [26]:
titanic.isna().sum()

Cabin       1014
Embarked       2
Fare           1
Pclass         0
Ticket         0
Age          263
Name           0
Parch          0
Sex            0
SibSp          0
Survived     418
dtype: int64

In [27]:
titanic_1 = titanic.loc[(~titanic.Embarked.isna()) & (~titanic.Fare.isna())]

In [28]:
titanic_1.isna().sum()

Cabin       1013
Embarked       0
Fare           0
Pclass         0
Ticket         0
Age          263
Name           0
Parch          0
Sex            0
SibSp          0
Survived     417
dtype: int64

In [29]:
titanic_1['Age'] = titanic_1['Age'].fillna(titanic_1.Age.mean())

/Users/shobhit/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [30]:
titanic_1.isna().sum()

Cabin       1013
Embarked       0
Fare           0
Pclass         0
Ticket         0
Age            0
Name           0
Parch          0
Sex            0
SibSp          0
Survived     417
dtype: int64

In [31]:
titanic_1.Age.mean()

29.813202301054687

In [32]:
titanic.loc[titanic.Pclass ==1, 'Age'].mean()

39.15992957746479

In [33]:
titanic.loc[titanic.Pclass ==2, 'Age'].mean()

29.506704980842912

In [34]:
titanic.loc[titanic.Pclass ==3, 'Age'].mean()

24.81636726546906

In [35]:
for name, grp in titanic.groupby(['Pclass', 'Sex']):
    print(name[0], name[1])

1 female
1 male
2 female
2 male
3 female
3 male

In [36]:
for name, grp in titanic.groupby(['Pclass', 'Sex']):
    print(name[0], name[1], round(grp['Age'].mean(), 2))

1 female 37.04
1 male 41.03
2 female 27.5
2 male 30.82
3 female 22.19
3 male 25.96

In [37]:
titanic_2 = titanic.loc[(~titanic.Embarked.isna()) & (~titanic.Fare.isna())]

In [38]:
mean_ages = titanic_2.groupby(['Pclass', 'Sex'])['Age'].transform(lambda x : x.fillna(x.mean()))

In [40]:
titanic_2.loc[:, 'Age'] = mean_ages

In [41]:
titanic_2

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
0,NaN,S,7.2500,3,A/5 21171,22.000000,"Braund, Mr. Owen Harris",0,male,1,0.0
1,C85,C,71.2833,1,PC 17599,38.000000,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,female,1,1.0
2,NaN,S,7.9250,3,STON/O2. 3101282,26.000000,"Heikkinen, Miss. Laina",0,female,0,1.0
3,C123,S,53.1000,1,113803,35.000000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,female,1,1.0
4,NaN,S,8.0500,3,373450,35.000000,"Allen, Mr. William Henry",0,male,0,0.0
...,...,...,...,...,...,...,...,...,...,...,...
1304,NaN,S,8.0500,3,A.5. 3236,25.863017,"Spector, Mr. Woolf",0,male,0,NaN
1305,C105,C,108.9000,1,PC 17758,39.000000,"Oliva y Ocana, Dona. Fermina",0,female,0,NaN
1306,NaN,S,7.2500,3,SOTON/O.Q. 3101262,38.500000,"Saether, Mr. Simon Sivertsen",0,male,0,NaN
1307,NaN,S,8.0500,3,359309,25.863017,"Ware, Mr. Frederick",0,male,0,NaN
1308,NaN,C,22.3583,3,2668,25.863017,"Peter, Master. Michael J",1,male,1,NaN

In [44]:
titanic[30:50]

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
30,NaN,C,27.7208,1,PC 17601,40.0,"Uruchurtu, Don. Manuel E",0,male,0,0.0
31,B78,C,146.5208,1,PC 17569,NaN,"Spencer, Mrs. William Augustus (Marie Eugenie)",0,female,1,1.0
32,NaN,Q,7.7500,3,335677,NaN,"Glynn, Miss. Mary Agatha",0,female,0,1.0
33,NaN,S,10.5000,2,C.A. 24579,66.0,"Wheadon, Mr. Edward H",0,male,0,0.0
34,NaN,C,82.1708,1,PC 17604,28.0,"Meyer, Mr. Edgar Joseph",0,male,1,0.0
35,NaN,S,52.0000,1,113789,42.0,"Holverson, Mr. Alexander Oskar",0,male,1,0.0
36,NaN,C,7.2292,3,2677,NaN,"Mamee, Mr. Hanna",0,male,0,1.0
37,NaN,S,8.0500,3,A./5. 2152,21.0,"Cann, Mr. Ernest Charles",0,male,0,0.0
38,NaN,S,18.0000,3,345764,18.0,"Vander Planke, Miss. Augusta Maria",0,female,2,0.0
39,NaN,C,11.2417,3,2651,14.0,"Nicola-Yarred, Miss. Jamila",0,female,1,1.0
40,NaN,S,9.4750,3,7546,40.0,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",0,female,1,0.0
41,NaN,S,21.0000,2,11668,27.0,"Turpin, Mrs. William John Robert (Dorothy Ann ...",0,female,1,0.0
42,NaN,C,7.8958,3,349253,NaN,"Kraeff, Mr. Theodor",0,male,0,0.0
43,NaN,C,41.5792,2,SC/Paris 2123,3.0,"Laroche, Miss. Simonne Marie Anne Andree",2,female,1,1.0
44,NaN,Q,7.8792,3,330958,19.0,"Devaney, Miss. Margaret Delia",0,female,0,1.0
45,NaN,S,8.0500,3,S.C./A.4. 23567,NaN,"Rogers, Mr. William John",0,male,0,0.0
46,NaN,Q,15.5000,3,370371,NaN,"Lennon, Mr. Denis",0,male,1,0.0
47,NaN,Q,7.7500,3,14311,NaN,"O'Driscoll, Miss. Bridget",0,female,0,1.0
48,NaN,C,21.6792,3,2662,NaN,"Samaan, Mr. Youssef",0,male,2,0.0
49,NaN,S,17.8000,3,349237,18.0,"Arnold-Franchi, Mrs. Josef (Josefine Franchi)",0,female,1,0.0

In [45]:
titanic_2[30:50]

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
30,NaN,C,27.7208,1,PC 17601,40.000000,"Uruchurtu, Don. Manuel E",0,male,0,0.0
31,B78,C,146.5208,1,PC 17569,36.839695,"Spencer, Mrs. William Augustus (Marie Eugenie)",0,female,1,1.0
32,NaN,Q,7.7500,3,335677,22.185329,"Glynn, Miss. Mary Agatha",0,female,0,1.0
33,NaN,S,10.5000,2,C.A. 24579,66.000000,"Wheadon, Mr. Edward H",0,male,0,0.0
34,NaN,C,82.1708,1,PC 17604,28.000000,"Meyer, Mr. Edgar Joseph",0,male,1,0.0
35,NaN,S,52.0000,1,113789,42.000000,"Holverson, Mr. Alexander Oskar",0,male,1,0.0
36,NaN,C,7.2292,3,2677,25.863017,"Mamee, Mr. Hanna",0,male,0,1.0
37,NaN,S,8.0500,3,A./5. 2152,21.000000,"Cann, Mr. Ernest Charles",0,male,0,0.0
38,NaN,S,18.0000,3,345764,18.000000,"Vander Planke, Miss. Augusta Maria",0,female,2,0.0
39,NaN,C,11.2417,3,2651,14.000000,"Nicola-Yarred, Miss. Jamila",0,female,1,1.0
40,NaN,S,9.4750,3,7546,40.000000,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",0,female,1,0.0
41,NaN,S,21.0000,2,11668,27.000000,"Turpin, Mrs. William John Robert (Dorothy Ann ...",0,female,1,0.0
42,NaN,C,7.8958,3,349253,25.863017,"Kraeff, Mr. Theodor",0,male,0,0.0
43,NaN,C,41.5792,2,SC/Paris 2123,3.000000,"Laroche, Miss. Simonne Marie Anne Andree",2,female,1,1.0
44,NaN,Q,7.8792,3,330958,19.000000,"Devaney, Miss. Margaret Delia",0,female,0,1.0
45,NaN,S,8.0500,3,S.C./A.4. 23567,25.863017,"Rogers, Mr. William John",0,male,0,0.0
46,NaN,Q,15.5000,3,370371,25.863017,"Lennon, Mr. Denis",0,male,1,0.0
47,NaN,Q,7.7500,3,14311,22.185329,"O'Driscoll, Miss. Bridget",0,female,0,1.0
48,NaN,C,21.6792,3,2662,25.863017,"Samaan, Mr. Youssef",0,male,2,0.0
49,NaN,S,17.8000,3,349237,18.000000,"Arnold-Franchi, Mrs. Josef (Josefine Franchi)",0,female,1,0.0